[
        {
            "bandName":"The All Brights",
            "hometown": "Santa Barbara, CA",
            "socials": {
                "facebook": "https://www.facebook.com/theallbrights/",
                "twitter": "https://twitter.com/theallbrights",
                "instagram": "https://instagram.com/theallbrights",
                "bandcamp": "https://theallbrights.bandcamp.com/",
                "website": null
            },
            "picture": "https://spacejockey.blob.core.windows.net/redscarecdn/bandpics/theallbrights.jpg",
            "bio": "Someone’s gotta say it: The All Brights are a joke band.  You can think whatever you want about satirical punk rock, but their songs and melodies are better than most anything out there.  For whatever reason, these four punk vets were all living in Santa Barbara and their only outlet to cope with “bro culture” was to write punk songs mocking the SoCal clownery that surrounded them.  They vaguely styled themselves as a “Gimme Gimmes meet Masked Intruder” operation, but the only real plan was to have a laugh.  And laugh we did, ‘cuz whenever they played a rare show, it was the funniest shit ever.  Couple of the dudes moved away (because unlike the band, Santa Barbara rent is no joke), so Big Wave Dave was forced to go solo, but the seas are unpredictable, and these beach boys could reunite if the conditions are just right… \n\n- tj"
        },
        {
            "bandName": "Arms Aloft",
            "hometown": "Eau Claire, WI",
            "socials": {
                "facebook": "https://www.facebook.com/armsaloft/",
                "twitter": "https://twitter.com/armsaloft",
                "instagram": "https://instagram.com/armsaloft",
                "bandcamp": "https://armsaloft.bandcamp.com/",
                "website": null
            },
            "picture": "https://spacejockey.blob.core.windows.net/redscarecdn/bandpics/armsaloft.jpg",
            "bio": "Arms Aloft are four Leftist punks from Eau Claire, Wisconsin. Ya know the quiet person that sits in the corner that only speaks up once a year, but when they do, they say something inspiring, thoughtful, and profound?  That’s Arms Aloft. Not the busiest group on the planet, but when the band materializes, the punk scene listens. They are loud and proud socialists (Alright, alright, alright, just the way we like ‘em), and if there’s ever some wacky Right Wing takeover in America *looks around, laughs nervously* they’re coming for Arms Aloft first. But good luck taking on this band, as they’re smart, scrappy, and they literally eat from garbage cans. What a time to be barely alive! \n\n- tj"
        },
        {
            "bandName": "Billy Liar",
            "hometown": "Edinburgh, Scotland",
            "socials": {
                "facebook": "https://www.facebook.com/official.billy.liar/",
                "twitter": "https://twitter.com/thebillyliar",
                "instagram": "https://www.instagram.com/officialbillyliar/",
                "bandcamp": "https://officialbillyliar.bandcamp.com/",
                "website": "https://www.billyliarmusic.com/"
            },
            "picture": "https://spacejockey.blob.core.windows.net/redscarecdn/bandpics/billyliar.jpg",
            "bio": "Billy Liar comes from Scotland and was recommended to us by a few comrades: The Bombpops, Joe McMahon, and some trusted UK folks.  They told us he’s a scrappy vegan kid that will hitchhike all over America and Europe to play his songs and win over crowds where ever he can get a show.  That much turned out to be true, but what made us pay attention was the songs.  Reminiscent of Billy Bragg and early Against Me!, Billy Liar can do love songs or protest songs or those risky songs where you bare your soul and tell the world that you fucked up.  Speaking of fucking up, we released his Red Scare debut in the middle of the Pandemic and all his tours got nixed, but that didn’t discourage the wee Scotsman one bit, as he’s back on the road making music and making friends.\n\n- tj"
        },
        {
            "bandName": "The Bollweevils",
            "hometown": "Chicago, IL",
            "socials": {
                "facebook": "https://www.facebook.com/thebollweevils",
                "twitter": "https://twitter.com/thebollweevils",
                "instagram": "https://www.instagram.com/the_bollweevils_chicago/",
                "bandcamp": "https://thebollweevils.bandcamp.com/",
                "website": null
            },
            "picture": "https://spacejockey.blob.core.windows.net/redscarecdn/bandpics/thebollweevils.jpg",
            "bio": "The Bollweevils are Chicago royalty that go all the way back to the lawless days of the 1980s punk scene.  Influenced by Windy City contemporaries Naked Raygun, The Effigies, and Pegboy, the Weevils also borrow heavily from “melodic hardcore” bands of the West Coast like Descendents and The Adolescents.  Led by the inspiring Dr. Daryl Wilson (an actual ER doc) on vocals and in spirit, the four-piece released music with Dr. Strange and Hopeless Records before making the no-brainer decision to join the ranks of Red Scare.  Since then, they’ve had quite the resuscitation: been playing a buncha shows, getting invites to big festivals, and blasting out their message of awareness, equality, and resistance. \n\n- tj"
        },
        {
            "bandName": "The Bombpops",
            "hometown": "Oceanside, CA",
            "socials": {
                "facebook": "https://www.facebook.com/TheBombpops/",
                "twitter": "https://twitter.com/thebombpops",
                "instagram": "https://www.instagram.com/thebombpops/",
                "bandcamp": "https://thebombpops.bandcamp.com/",
                "website": "https://www.thebombpops.com/"
            },
            "picture": "https://spacejockey.blob.core.windows.net/redscarecdn/bandpics/thebombpops.jpg",
            "bio": "Forming in 2007, The Bombpops came straight outta Oceanside, California.  No shit, it’s one of the prettiest places on planet Earth.  Despite the optimal climate and inviting surf, these kids were making aggressive, sassy, brash punk rock that was heavily influenced by their SoCal predecessors.  Many Red Scare bands had crossed paths with the ‘Pops and many said we need to work with them.  The initial phone conversation went something like this… Jen: “We love Red Scare, but we don’t wanna be known as a ‘girl punk band’, ya know?”  Us: “Yeah, cool.  You can just be a punk band on Red Scare.”  We’re paraphrasing here, but that’s pretty much how it started.  From there, we released their first two EPs and helped them get their footing as a young band before they started touring and diving into full length recordings.  They coulda just stayed in sunny Oceanside, but naw, they’ve since gone on to tour with Bad Religion, Bayside, Dropkick Murphys, Masked Intruder, Descendents, and more. \n\n- tj"
        },
        {
            "bandName": "Brendan Kelly",
            "hometown": "Chicago, IL",
            "socials": {
                "facebook": null,
                "twitter": "https://twitter.com/badsandwich",
                "instagram": "https://instagram.com/dr_beexo",
                "bandcamp": "https://brendankellyandthewanderingbirds.bandcamp.com/",
                "website": "https://badsandwich.substack.com/"
            },
            "picture": "https://spacejockey.blob.core.windows.net/redscarecdn/bandpics/brendankelly.jpg",
            "bio": "Brendan Kelly is the dude from The Lawrence Arms and The Falcon.  Chicago boy done good.  Sometimes he goes solo and sometimes he soars with a dubious crew called the Wandering Birds.  He’s done a couple LPs and some 7”s with Red Scare, and it’s all pretty freaky stuff: songs about torture, songs about drugs, songs about pervs, songs about serial killers, and songs about your mom.  The recordings are definitely not your typical punk acoustic faire as he works with a full band of deviant collaborators, and the live show has been described as Andy Kaufman goes Kafka, but with songs about your mom. \n\n- tj"
        },
        {
            "bandName": "Broadway Calls",
            "hometown": "Rainier, OR",
            "socials": {
                "facebook": "https://www.facebook.com/broadwaycalls",
                "twitter": "https://twitter.com/broadwaycalls",
                "instagram": "https://instagram.com/broadwaycalls",
                "bandcamp": "https://broadwaycalls.bandcamp.com/",
                "website": null
            },
            "picture": "https://spacejockey.blob.core.windows.net/redscarecdn/bandpics/broadwaycalls.jpg",
            "bio": "Broadway Calls are an Oregon trio that started out on Green Day’s imprint, Adeline Records, then moved to Side One Dummy… then a couple more labels that subsequently died… then won the music biz lottery and ended up on immortal Red Scare Industries in 2019.  They have a minimalist approach and maximum sound, not unlike The Jesus and Mary Chain or Ramones.  They’ve done the Warped Tour, played Tokyo with Taylor Swift and Jay Z (wish we were lying), toured the UK with Alkaline Trio, etc.  These humble kids have been on magazine covers, heard on commercial radio, and the bass player even owns an actual bulldozer.  Not bad for three BFFs from the woods of the Pacific Northwest. \n\n- tj"
        },
        {
            "bandName": "The Brokedowns",
            "hometown": "Elgin, IL",
            "socials": {
                "facebook": "https://www.facebook.com/thebrokedowns",
                "twitter": "https://twitter.com/thebrokedowns",
                "instagram": "https://instagram.com/thebrokedowns",
                "bandcamp": "https://thebrokedowns.bandcamp.com/",
                "website": "https://thebrokedowns.com/"
            },
            "picture": "https://spacejockey.blob.core.windows.net/redscarecdn/bandpics/brokedowns.jpg",
            "bio": "We at Red Scare like to fuck around and boast about our cred, but no one can touch The Brokedowns.  (We’re aware we have siphoned off a fair amount of their cred, thank you.)  A quartet from Chicagoland made up of tradesmen and teachers and a pizza chef named Mustafa.  They’re catchy, but not poppy.  Aggressive, but not macho or heavy.  They goof about drugs and pop culture, and they seem to be having a good time with it all… except they’re not.  They’re the most serious/unserious band on the planet, and if you pay attention, they’re begging you to pull your head outta your ass and pay attention to the bullshit around us. \n\n- tj"
        },
        {
            "bandName": "Bullets To Broadway",
            "hometown": "Gainesville, FL",
            "socials": {
                "facebook": null,
                "twitter": null,
                "instagram": null,
                "bandcamp": "https://bulletstobroadway.bandcamp.com/",
                "website": null
            },
            "picture": "https://spacejockey.blob.core.windows.net/redscarecdn/bandpics/bulletstobroadway.jpg",
            "bio": "Bullets To Broadway was the merger of three ex-members of Teen Idols and two guitar shredders from Rehasher.  Gainesville grit meets Nashville heat.  They were the third band signed to Red Scare in 2005 and have only one glorious release: an 8-song EP produced by Less Than Jake’s, Roger Lima.  The band toured like hell (they were sponsored by Sparks and Taco Bell, after all), but things slowed down when Heather and Gui started a family, Ryan Geis got into animal husbandry, and Matt Drastic took over on drums for LTJ.  They reunited recently to play Fest, so maybe we’ll get to see and hear more of this squirrely punk quintet?!\n\n- tj"
        },
        {
            "bandName": "Cobra Skulls",
            "hometown": "Reno, NV",
            "socials": {
                "facebook": "https://www.facebook.com/cobraskulls",
                "twitter": "https://twitter.com/cobraskulls",
                "instagram": "https://instagram.com/cobraskulls",
                "bandcamp": "https://cobraskulls.bandcamp.com/",
                "website": null
            },
            "picture": "https://spacejockey.blob.core.windows.net/redscarecdn/bandpics/cobraskulls.jpg",
            "bio": "Straight out of Reno is a crazy motherfucker named Devin Peralta: part skateboard, part serpentine mongoose, part Cramps logo.  Devin and his various skin-challenged serpentine cohorts spent years crisscrossing this great nation charming the children with their music so effortlessly, it was as though they were in baskets in an open air market in an Indiana Jones movie or something.  Seriously though, Cobra Skulls are the most old school meets new school political horror self-reflective ophidiophilic stripped-down acoustic lushly instrumental melodic screechy deadly serious total party band you’ll ever meet. \n\nSadly, you won’t have too many chances to meet them anymore.  Pulled up from their den by Red Scare, the Cobra Skulls gained enough attention in the national punk scene that Fat Wreck Chords decided to do what it does best, namely stroll through the Red Scare orchards and harvest the ripest fruits to take home for themselves.  And the Skulls were exactly the ripe and fecund fruits that wanted, needed to be plucked. \n\nHowever, irony is a cruel mistress, for this seemingly game-changing move to a larger label only inspired the ever-unpredictable Devin to look at the bigger picture and make some changes and do some fruit plucking himself.  What does that mean?  Long story short he’s a farmer that sells oranges now and as a result they barely play anymore.  But when they do, they scream and croon in Spanish and English, and if you stand very still and can ignore the infrastructural collapse of Reno as it bursts around you like a plague boil, you can hear the serpents slithering up from the sewers, once again entranced by the singular siren song of the Cobra Skulls, amassing and preparing to take over the whole fucking world. \n\n- bk"
        },
        {
            "bandName": "The Copyrights",
            "hometown": "Carbondale, IL",
            "socials": {
                "facebook": "https://www.facebook.com/thecopyrights",
                "twitter": "https://twitter.com/thecopyrights",
                "instagram": "https://instagram.com/thecopyrights",
                "bandcamp": "https://thecopyrights.bandcamp.com/",
                "website": null
            },
            "picture": "https://spacejockey.blob.core.windows.net/redscarecdn/bandpics/copyrights.jpg",
            "bio": "To call Carbondale, Illinois a hell on earth would be giving a lot of credit to your idea of hell.  If hell is hard-living roving gangs of party animals fueled by McDonald’s cheeseburgers found on the floor of the last party, and glue vapors, propelled ever forward to god-knows-what-next nowhere all while every single person involved howls along to the pop punk masterpieces laid down by local legends, The Copyrights, then yeah, it’s a lot like Carbondale. \n\nJust like in their hometown of Carbondale, there are no rules in The Copyrights.  The drummer writes the songs but doesn’t even usually tour with them.  One of the dudes lives in a trailer park and cooks squirrels and shit and also makes giant art installations for Coachella and is internationally renowned as a great visionary artist by the most elite fart-sniffing tastemakers of our time.  The bass player refuses to age.  The lead singer is everyone in the band, every word, all the time.  They’ve been playing deceptively simple pop punk for a thousand years and went from promising to disappointing to safe and boring to promising to beloved to brilliant subverters of the whole idea of pop punk while still remaining 100% true to it to legends all without doing anything different or noticing that they were being perceived at all.  And they did all this by pounding out some of the no shit, greatest most emblematic punk anthems you’ll ever hear in any genre by any band (see: “Passport”, “Shit’s Fucked”, “Crutches”, etc). \n\nAlso, The Copyrights will never die, but that doesn’t mean you should slack on seeing them.  They’re getting older (besides the aforementioned singer, Fletcher), and to paraphrase the words of Stevie Nicks, you’re getting older too. \n\nOh yeah, and one of the guitar players is named Funburg.  For real. \n\n- bk"
        },
        {
            "bandName": "Derek Grant",
            "hometown": "Chicago, IL",
            "socials": {
                "facebook": "https://www.facebook.com/derekgrant",
                "twitter": null,
                "instagram": "https://instagram.com/derekdontgram",
                "bandcamp": "https://derekgrant.bandcamp.com/",
                "website": null
            },
            "picture": "https://f4.bcbits.com/img/0009466635_10.jpg",
            "bio": null
        },
        {
            "bandName": "Direct Hit!",
            "hometown": "Milwaukee, WI",
            "socials": {
                "facebook": "https://www.facebook.com/directhitband",
                "twitter": "https://twitter.com/directhit_sucks",
                "instagram": "https://instagram.com/directhitband",
                "bandcamp": "https://directhit.bandcamp.com/",
                "website": "https://crownofnothing.com/"
            },
            "picture": "https://spacejockey.blob.core.windows.net/redscarecdn/bandpics/directhit.jpg",
            "bio": "Direct Hit! is a Wisconsin-based quartet of rascals that plays frantic punk rock and released two albums and a few EPs with Red Scare.  Their music is a cracked mirror reflection of frontman Nick Woods’ twisted brain: wacky blasts moving a mile-a-minute, dominated by thoughts of the devil and drugs.  They’ve had a bit of a rotating cast in terms of members because not many people can keep up with their manic pace, but DH! Is decidedly a band based in Milwaukee.  Which explains why the band is insane and how they’re probably gonna be featured in a true crime docudrama.  Should be great for record sales. \n\n- tj"
        },
        {
            "bandName": "Drakulas",
            "hometown": "Austin, TX",
            "socials": {
                "facebook": "https://www.facebook.com/drakulastx",
                "twitter": "https://twitter.com/drakulastx",
                "instagram": "https://instagram.com/drakulastx",
                "bandcamp": "https://drakulas.bandcamp.com/",
                "website": null
            },
            "picture": "https://spacejockey.blob.core.windows.net/redscarecdn/bandpics/drakulas.jpg",
            "bio": "We were asked recently how Drakulas debut release ended up on Red Scare and this answer sums up their tale:\n\nThis is funny, I was selling merch for The Lawrence Arms at a show they were playing with Rise Against in Chicago at Aragon.  Huge venue.  I’m walking in during the Rise Against soundcheck, where nobody else is in this cavernous place except the band, and Rise guitar player Zach Blair says booming into the mic, “TOBY, ARE YOU GOING TO PUT OUT THE DRAKULAS 7” OR WHAT?”  I felt like I didn’t have much choice, haha.  Truth is, I love Zach (henceforth known as Zakula), and I think Mike Wiebe is easily top 3 singers alive, so this was an easy yes.  This is maybe their best release, and what I really love about this band is the wacky lore they have concocted for the band’s backstory.  They’re, uhhh, like a post-apocalyptic street gang with… cult tendencies?  It’s worth googling.\n\nWe stand by that description.  An absolutely ripping band. \n\n- tj"
        },
        {
            "bandName": "Druglords of the Avenues",
            "hometown": "Oakland, CA",
            "socials": {
                "facebook": "https://www.facebook.com/druglordsoftheavenues",
                "twitter": "https://twitter.com/druglordsband",
                "instagram": "https://instagram.com/druglordsoftheavenues",
                "bandcamp": "https://druglordsoftheavenues.bandcamp.com/",
                "website": null
            },
            "picture": "https://spacejockey.blob.core.windows.net/redscarecdn/bandpics/druglords.jpg",
            "bio": null
        },
        {
            "bandName": "Elway",
            "hometown": "Fort Collins, CO",
            "socials": {
                "facebook": "https://www.facebook.com/ElwayTheBand",
                "twitter": "https://twitter.com/elwaytheband",
                "instagram": "https://instagram.com/elwaytheband",
                "bandcamp": "https://elwaytheband.bandcamp.com/",
                "website": null
            },
            "picture": "https://spacejockey.blob.core.windows.net/redscarecdn/bandpics/elway.jpg",
            "bio": "Spanish for “the way” Elway is a Mandelorian band who came to Earth piloted by noted Jean Luc Picard enthusiast, Time Browne, and crash landed in Colorado where they’ve taken the instrumentation of Propagandhi, paired it with the melodies of Taylor Swift and lyricism straight from Holden Caulfield if he had a little more Mark David Chapman in him. \n\nElway mixed this musical granola together on the great highways of America and the sex-fueled highways of Europe for years before finally settling into a comfortable rut as disapproving professionals who come together once in a while to shock their friends when it turns out that “the band I’m in” is actually good. \n\nCould your friend who loves Crosby Stills and Nash listen to Elway?  Sure!  Elway sounds a little like if they were Crosby, Crosby, and Crosby at times, a wasted and gleeful meat and potatoes take on classic rock and roll.  Though they’ll tell you they’re more of a Silver Bullet band, only the second guitarist Brian can even so much as change his own oil, and truth be told, that’s fine.  Elway sounds like Elway more than they sound like who they think they sound like, or who their detractors say they sound like, which is to say, they’re great and unique, disguised as a fairly straight forward punk-influenced rock band. \n\nIf it weren’t for angsty politically aware teachers, coders, activists, and whatever the fuck Squid (real birth name!) does, then there wouldn’t be the effortlessly crushable easy-drinking hard-thinking Elway, who truly, truly are both the smartest and the dumbest band you will ever meet in your life. \n\n- bk"
        },
        {
            "bandName": "Enemy You",
            "hometown": "San Francisco, CA",
            "socials": {
                "facebook": "https://www.facebook.com/p/Enemy-You-100066488358195/",
                "twitter": null,
                "instagram": null,
                "bandcamp": "https://enemyyou.bandcamp.com/",
                "website": null
            },
            "picture": "https://spacejockey.blob.core.windows.net/redscarecdn/bandpics/enemyyou.jpg",
            "bio": "Believe it or not, before tech bros showed up and stunk up the place, San Francisco used to have a robust punk scene.  Bands like Dead Kennedys, The Avengers, Swingin’ Utters, Jawbreaker, One Man Army, and many more.  Enemy You was cut from that same cloth in 1997 and made their mark on the Bay Area punk scene and beyond.  They first released material with Lookout / Panic Button Records before linking up with Red Scare in 2004.  We released their album on the same day as The Falcon EP, and without Enemy You, there would be no Red Scare.  The record received stellar reviews and EY went on to tour with The Lawrence Arms, play some festivals, and gain fans around the planet.  Their music was a reflection of singer David’s very cathartic songwriting with his love for culture critics like Bad Religion, J.D. Salinger, and Joe Strummer. \n\nFrankly, it’s painful to discuss Enemy You because David took his own life in 2015, and he was friends with half of the folks on the label.  But their songs live on, and several bands (The Lillingtons, The Bombpops, etc.) have covered their music as a tribute.  Enemy You is never coming back, but David would want you to take his words and do something good with it.  Let’s get to work. \n\n- tj"
        },
        {
            "bandName": "The Falcon",
            "hometown": "Chicago, IL",
            "socials": {
                "facebook": "https://www.facebook.com/MoFukkinFalcon/",
                "twitter": "https://twitter.com/mofukkinfalcon",
                "instagram": null,
                "bandcamp": "https://mofukkinfalcon.bandcamp.com/",
                "website": null
            },
            "picture": "https://f4.bcbits.com/img/0008477196_25.jpg",
            "bio": null
        },
        {
            "bandName": "Fleau",
            "hometown": "Lyon, France",
            "socials": {
                "facebook": "https://www.facebook.com/FleauXdestruction/",
                "twitter": null,
                "instagram": "https://www.instagram.com/fleau.destruction",
                "bandcamp": "https://fleau.bandcamp.com/",
                "website": null
            },
            "picture": "https://f4.bcbits.com/img/0023734045_10.jpg",
            "bio": null
        },
        {
            "bandName": "Garrett Dale",
            "hometown": "Oklahoma City, OK",
            "socials": {
                "facebook": null,
                "twitter": null,
                "instagram": "https://instagram.com/garrettdale",
                "bandcamp": "https://garrettdale.bandcamp.com/",
                "website": null
            },
            "picture": "https://f4.bcbits.com/img/0010416735_10.jpg",
            "bio": "Garrett gets mad every time we try and write something about him, so we’ll leave it at this: TWO Ts, PLEASE! \n\nHe’s a real stickler about the Ts, but never says shit about the two Rs.  Garrett is from Oklahoma and fronted hometown heroes, Red City Radio for most of his youth.  Then he grew up and moved to Alberta, which is the Oklahoma of Canada.  Red Scare has put out a few GD songs, but we mostly get requests for “Gravity Bong” to be released.  Take that up with him.  His favorite team is the Raiders and his favorite city is Las Vegas.  Can you imagine the day he found out that the Raiders were moving TO Las Vegas?!  Straight to the gravity bong. \n\n- tj"
        },
        {
            "bandName": "Good Friend",
            "hometown": "Derry, Ireland",
            "socials": {
                "facebook": "https://www.facebook.com/goodfriendofficial",
                "twitter": "https://twitter.com/goodfriendband",
                "instagram": "https://instagram.com/goodfriendband",
                "bandcamp": "https://goodfriend.bandcamp.com/",
                "website": null
            },
            "picture": "https://f4.bcbits.com/img/0023518320_10.jpg",
            "bio": null
        },
        {
            "bandName": "Guerilla Poubelle",
            "hometown": "Paris, France",
            "socials": {
                "facebook": "https://www.facebook.com/gxpgxp",
                "twitter": "https://twitter.com/gxpgxp",
                "instagram": null,
                "bandcamp": "https://guerillapoubelle.bandcamp.com/",
                "website": "https://www.guerilla-poubelle.com/"
            },
            "picture": "https://spacejockey.blob.core.windows.net/redscarecdn/bandpics/GPinGreece2020.jpg",
            "bio": "Guerilla Poubelle are probably the biggest punk rock band in Paris, and they came highly recommended from several Red Scare comrades who toured through France.  They’re vocal anti-fascists who are renowned for all the work they’ve done to help the scene, and we figured we better team up so we could steal some of their good karma and punk cred.  These activists have done a lot of benefits and work promoting good causes, but their biggest act of charity is to have played 100+ shows with labelmates, Arms Aloft.  Talk about generosity.  Could you imagine?!  Joking aside, we love to see Leftist bands working together to bring a spirit of collectivism and egalitarian message to the community, so high five to GPxAA for that.  People have called these “French crusties” every name in the book: screamo, anarcho streetpunk, hardcore… who knows, but they are one of the tightest trios in punk rock and always deliver an explosive live set.\n\n- tj"
        },
        {
            "bandName": "Heart & Lung",
            "hometown": "Cleveland, OH",
            "socials": {
                "facebook": "https://www.facebook.com/heartandlungband",
                "twitter": "https://twitter.com/heartandlungband",
                "instagram": "https://instagram.com/heartandlung",
                "bandcamp": "https://heartandlung.bandcamp.com/",
                "website": null
            },
            "picture": "https://spacejockey.blob.core.windows.net/redscarecdn/bandpics/heartandlung.jpg",
            "bio": "They say the heart of rock ‘n’ roll is in Cleveland.  They also say Heart & Lung are from Cleveland.  Hardly a coincidence!  We found them because Matt from The Sidekicks demanded we check them out, and another dude who does punk shows in Ohio emailed us and essentially said, “I know you guys like socially-conscious, inclusive punk rock… and this band is GOOD too.”  True story, and they were right on.  Also right on is H&L’s message.  Also right on are their harmonies, because this band has three singers.  They’re a quintessential Midwest punk quartet that blends some crooning with chaos.  The members of Heart & Lung are real punks with real jobs (teacher, cook, etc.), so they can’t live on the road, but since being gobbled up by Red Scare, they’ve been able to play some packed festival shows and tour with Brendan Kelly, Elway, and No Trigger.  More good things ahead for these North Coast punks! \n\n- tj"
        },
        {
            "bandName": "The Heat Tape",
            "hometown": "Makanda, IL",
            "socials": {
                "facebook": "https://www.facebook.com/theheattape",
                "twitter": "https://twitter.com/theheattape",
                "instagram": "https://instagram.com/theheattape",
                "bandcamp": "https://theheattape.bandcamp.com/",
                "website": null
            },
            "picture": "https://f4.bcbits.com/img/0009414163_10.jpg",
            "bio": null
        },
        {
            "bandName": "The Holy Mess",
            "hometown": "Stroudsburg, PA",
            "socials": {
                "facebook": "https://www.facebook.com/theholymesspa",
                "twitter": "https://twitter.com/fucktheholymess",
                "instagram": "https://instagram.com/theholymess",
                "bandcamp": "https://fucktheholymess.bandcamp.com/",
                "website": null
            },
            "picture": "https://f4.bcbits.com/img/0007025137_10.jpg",
            "bio": null
        },
        {
            "bandName": "La Plebe",
            "hometown": "San Francisco, CA",
            "socials":{
                "facebook": null,
                "twitter": null,
                "instagram": null,
                "bandcamp": "https://laplebe.bandcamp.com/",
                "website": null
            },
            "picture": "https://f4.bcbits.com/img/0003466310_10.jpg",
            "bio": null
        },
        {
            "bandName": "Laura Jane Grace",
            "hometown": "Chicago, IL",
            "socials":{
                "facebook": "https://www.facebook.com/LauraJaneGraceofficial/",
                "twitter": "https://twitter.com/laurajanegrace",
                "instagram": "https://instagram.com/laurajanegrace",
                "bandcamp": "https://laurajanegrace.bandcamp.com/",
                "website": "https://www.laurajanegrace.com/"
            },
            "picture": "https://f4.bcbits.com/img/0034440014_10.jpg",
            "bio": null
        },
        {
            "bandName": "The Lillingtons",
            "hometown": "Newcastle, WY",
            "socials": {
                "facebook": "https://www.facebook.com/thelillingtons",
                "twitter": null,
                "instagram": "https://instagram.com/thelillingtons",
                "bandcamp": "https://thelillingtons.bandcamp.com/",
                "website": null
            },
            "picture": "https://f4.bcbits.com/img/0009395532_10.jpg",
            "bio": null
        },
        {
            "bandName": "The Lippies",
            "hometown": "Grand Rapids, MI",
            "socials": {
                "facebook": "https://www.facebook.com/TheLippiesGR/",
                "twitter": "https://twitter.com/the_lippies",
                "instagram": "https://instagram.com/the_lippies",
                "bandcamp": "https://thelippies.bandcamp.com/",
                "website": null
            },
            "picture": "https://f4.bcbits.com/img/0016147120_10.jpg",
            "bio": null
        },
        {
            "bandName": "MakeWar",
            "hometown": "Brooklyn, NY",
            "socials": {
                "facebook": "https://www.facebook.com/MakeWarMusic/",
                "twitter": "https://twitter.com/makewarmusic",
                "instagram": "https://instagram.com/makewarmusic",
                "bandcamp": "https://makewar.bandcamp.com/",
                "website": "https://www.makewarband.com/#makewar"
            },
            "picture": "https://f4.bcbits.com/img/0009396646_10.jpg",
            "bio": null
        },
        {
            "bandName": "Masked Intruder",
            "hometown": "Madison, WI",
            "socials": {
                "facebook": "https://www.facebook.com/maskedintruder",
                "twitter": "https://twitter.com/maskedintruder1",
                "instagram": "https://instagram.com/maskedintruder",
                "bandcamp": "https://maskedintruder.bandcamp.com/",
                "website": null
            },
            "picture": "https://f4.bcbits.com/img/0000091543_10.jpg",
            "bio": null
        },
        {
            "bandName": "The Menzingers",
            "hometown": "Scranton, PA",
            "socials": {
                "facebook": "https://www.facebook.com/themenzingers",
                "twitter": "https://twitter.com/themenzingers",
                "instagram": "https://instagram.com/themenzingers",
                "bandcamp": "https://themenzingers.bandcamp.com/",
                "website": "https://themenzingers.com/"
            },
            "picture": "https://f4.bcbits.com/img/0032975383_10.jpg",
            "bio": null
        },
        {
            "bandName": "The Methadones",
            "hometown": "Chicago, IL",
            "socials": {
                "facebook": "https://www.facebook.com/themethadones",
                "twitter": "https://twitter.com/themethadones",
                "instagram": "https://instagram.com/themethadones",
                "bandcamp": "https://themethadones.bandcamp.com/",
                "website": null
            },
            "picture": "https://spacejockey.blob.core.windows.net/redscarecdn/bandpics/themethadones.jpg",
            "bio": "The Methadones have bounced around labels like Thick Records, A-F Records, Asian Man Records, etc., but being that they’re Chicago punk legends, it’s plainly evident that Red Scare is their true spiritual home.  We’ve done a couple of their LPs, and now they're back with a new 7”: <i>Love On Layaway</i>.  Fronted by Dan Schafer and backed by some stalwart Midwesterners, this quartet has produced some of THE best pop-punk tunes ever.  They go through bouts of inactivity, but have toured with The Soviettes, The Lawrence Arms, The Copyrights, et al, and will still pop up for occasional shows.  Everyone in the scene is excited when the ‘Dones surface with new music, and we’re honored to help share their genius melodies with the world. \n\n- tj"
        },
        {
            "bandName": "No Trigger",
            "hometown": "Worcester, MA",
            "socials": {
                "facebook": "https://www.facebook.com/notrigger",
                "twitter": "https://twitter.com/notrigger",
                "instagram": "https://instagram.com/notrigger",
                "bandcamp": "https://notrigger.bandcamp.com/",
                "website": null
            },
            "picture": "https://f4.bcbits.com/img/0033565919_10.jpg",
            "bio": null
        },
        {
            "bandName": "Nothington",
            "hometown": "San Francisco, CA",
            "socials": {
                "facebook": "https://www.facebook.com/nothington",
                "twitter": "https://twitter.com/nothington",
                "instagram": "https://instagram.com/nothington_band",
                "bandcamp": "https://nothington.bandcamp.com/",
                "website": null
            },
            "picture": "https://f4.bcbits.com/img/0008817464_10.jpg",
            "bio": null
        },
        {
            "bandName": "Ramona",
            "hometown": "Philadelphia, PA",
            "socials": {
                "facebook": "https://www.facebook.com/ramona206",
                "twitter": "https://twitter.com/hey_yo_ramona",
                "instagram": "https://instagram.com/ramonamusic",
                "bandcamp": "https://ramonamusic.bandcamp.com/",
                "website": null
            },
            "picture": "https://f4.bcbits.com/img/0008424538_10.jpg",
            "bio": null
        },
        {
            "bandName": "The Reaganomics",
            "hometown": "Joliet, IL",
            "socials": {
                "facebook": "https://www.facebook.com/thereaganomics",
                "twitter": "https://twitter.com/thereaganomics",
                "instagram": "https://instagram.com/the_reaganomics",
                "bandcamp": "https://thereaganomics.bandcamp.com/",
                "website": null
            },
            "picture": "https://f4.bcbits.com/img/0009459683_10.jpg",
            "bio": null
        },
        {
            "bandName": "Red City Radio",
            "hometown": "Oklahoma City, OK",
            "socials": {
                "facebook": "https://www.facebook.com/redcityradio",
                "twitter": "https://twitter.com/redcityradio",
                "instagram": "https://instagram.com/redcityradio",
                "bandcamp": "https://redcityradio.bandcamp.com/",
                "website": "https://redcityradio.com/"
            },
            "picture": "https://f4.bcbits.com/img/0012554470_10.jpg",
            "bio": null
        },
        {
            "bandName": "SACK",
            "hometown": "Denver, CO",
            "socials": {
                "facebook": "https://www.facebook.com/SACKSTREETROCK/",
                "twitter": "https://twitter.com/sackstreetrock",
                "instagram": "https://www.instagram.com/sackstreetrock/",
                "bandcamp": "https://sackstreetrock.bandcamp.com/",
                "website": null
            },
            "picture": "https://spacejockey.blob.core.windows.net/redscarecdn/bandpics/sack.jpg",
            "bio": "We like to play up SACK’s mythology, but every once in a while those of us in the Red Scare Band Biography Department feel compelled to tell the truth, so here’s what we ACTUALLY know about SACK: The band formed in Wyoming when The Lillingtons dissolved for the first time, after their The Too Late Show LP.  So, we’re talkin’ around 2002/2003.  When SACK started, they weren’t just a band, they were an attitude.  It was motorbikes and fast drums and bad hair and guzzling beer and hedonistic, thrashy punk rock.  Truly an “all gas no brakes” style of music.  SACK had the late Brandon Carlisle on drums, which eventually led to the merger of Kody Lillington and Teenage Bottlerocket.  Years went by and SACK remained a secret while TBR and The Lillingtons toured and released a ton of music, but when Kody relocated to Colorado and the Pandemic hit, it was time to recruit some local shit-kickers to revive SACK.  After 2022’s Ripper! was released on Red Scare, it was clear that this wasn’t just a side project, as the band did actual tours and now have ambitions to keep on shredding up the country with bangers like, “Turf War” and “Live, Laugh, LARP”.  Speaking of ambition, SACK are the first ever music act to perform onstage with a band member that just hands out cans of beer during their live set.  Go see ‘em and witness showbiz history! \n\n- tj"
        },
        {
            "bandName": "Sam Russo",
            "hometown": "Haverhill, UK",
            "socials":{
                "facebook": "https://www.facebook.com/samrusso113",
                "twitter": "https://twitter.com/samrussomusic",
                "instagram": "https://instagram.com/samrussomusic",
                "bandcamp": "https://samrusso.bandcamp.com/",
                "website": "https://samrusso.bigcartel.com/"
            },
            "picture": "https://spacejockey.blob.core.windows.net/redscarecdn/bandpics/samrusso%20(2).jpg",
            "bio": "Years ago, Brendan Kelly and Dan Andriano did a tour of Europe, and they brought back a buncha raunchy tales and a pile of band demos intended for Red Scare.  As usual, we disregarded their dubious plunder, but they insisted we check out Sam Russo from the UK.  “You’re gonna love this guy, he snuck into Cuba!”  Not sure the Cuba part is true, but they were right about his songs.  They said he was one of us: a solemn wiseass with a very unique sense of cadence and melody, setting him apart from all the other punk/solo stuff that was in our orbit.  We’ve now done a handful of singles and EPs with the gent from East Anglia, and 2025’s <i>Hold You Hard</i> marks his fourth full length on Red Scare.\n\nRusso doesn’t live in one of the chic punk hubs like Manchester or London, and boy does it show.  For better or worse, Sam is an outsider from England’s hinterlands, and that’s reflected in his art.  Themes of solitude persist, but in a plot twist that would confound Shyamalan… Sam has a fixation with American beach culture?  Well, he’s a pasty Brit from the Suffolk wheat fields, so let a boy have his harmless dreams.  Considering all the traveling he does (toured with Tim Barry, The Lawrence Arms, Lucero, and more), he’ll eventually find his way to the sea and surf that he dreams about in his verses. \n\n- tj"
        },
        {
            "bandName": "Sicko",
            "hometown": "Seattle, WA",
            "socials": {
                "facebook": "https://www.facebook.com/sickotheband",
                "twitter": "https://twitter.com/sickotheband",
                "instagram": "https://instagram.com/sickotheband",
                "bandcamp": "https://sickotheband.bandcamp.com/",
                "website": "https://www.sicko.com/"
            },
            "picture": "https://f4.bcbits.com/img/0010266936_36.jpg",
            "bio": null
        },
        {
            "bandName": "The Sidekicks",
            "hometown": "Columbus, OH",
            "socials": {
                "facebook": "https://www.facebook.com/sidekicksohio",
                "twitter": "https://twitter.com/sidekicksohio",
                "instagram": "https://instagram.com/sidekicksohio",
                "bandcamp": "https://sidekicksohio.bandcamp.com/",
                "website": null
            },
            "picture": "https://spacejockey.blob.core.windows.net/redscarecdn/bandpics/sidekicks.jpg",
            "bio": "Don’t feel too bad…pretty much everyone missed The Sidekicks.  Forged in the deepest subterranean mines of Cleveland, Ohio, The Sidekicks were one of those incredible indie rock/punk/pop/wizard combos that everyone agrees made some of the best music of the millennium.  No, really.  Their last few records were all over “best of” lists, but who cares now, right?  They’re dead. \n\nRed Scare snapped up The Sidekicks when they were wee pups and properly put out their first album, So Long, Soggy Dog (which was a tribute to a punk house), all on the strength of a cell phone video of guitarist/vocalist Steve Ciolek playing the bass solo of Rancid’s “Maxwell Murder” FLAWLESSLY while sitting on a couch in a hoodie in his underwear and participating in the rather reckless mosh pit that his homies had started on said couch. \n\nFrom there, he and drummer Matt Climer have cycled through some members, growing and expanding in unexpected ways, finally coming out of their chrysalis state on their album Awkward Breeds as a band with more in common with Band of Horses and Flaming Lips than Rancid.  They signed to Epitaph, put out even more great records and then they broke up because you didn’t come see them. Now they all work at Skyline Chili in Cincinnati because just like the other greatest thing to come out of Cleveland, LeBron, their own city has turned on them just for being incredible and daring to dream. \n\n- bk"
        },
        {
            "bandName": "Sincere Engineer",
            "hometown": "Chicago, IL",
            "socials": {
                "facebook": "https://www.facebook.com/sincereengineer",
                "twitter": "https://twitter.com/sincereengineer",
                "instagram": "https://instagram.com/sincereengineer",
                "bandcamp": "https://sincereengineer.bandcamp.com/",
                "website": "https://sincereengineer.com/"
            },
            "picture": "https://spacejockey.blob.core.windows.net/redscarecdn/bandpics/sincereengineer.jpg",
            "bio": "Sincere Engineer began as a solo project for Deanna Belos, a nervous nerd from the same Chicago burbs that gave the world Slapstick and The Brokedowns.  Red Scare booked her first real live show, supporting labelmates Brendan Kelly and Sam Russo at Double Door in Chicago.  Not long after we released her debut album and got her on some big festivals and a tour opening for The Lawrence Arms.  Next thing we know, she’s got herself a full band and a big record deal with them fancy folks out in Smellay!  The band continues to grow and keeps a busy tour schedule, and we continue to sing along and cheer for Sincere Engineer…\n\n- tj"
        },
        {
            "bandName": "Sludgeworth",
            "hometown": "Chicago, IL",
            "socials": {
                "facebook": "https://www.facebook.com/sludgeworth",
                "twitter": "https://twitter.com/sludgeworth",
                "instagram": "https://instagram.com/sludgeworth",
                "bandcamp": "https://sludgeworth.bandcamp.com/",
                "website": null
            },
            "picture": "https://f4.bcbits.com/img/0030474158_10.jpg",
            "bio": null
        },
        {
            "bandName": "Success",
            "hometown": "Seattle, WA",
            "socials": {
                "facebook": "https://www.facebook.com/successpunk",
                "twitter": "https://twitter.com/successpunk",
                "instagram": "https://instagram.com/successpunk",
                "bandcamp": "https://successpunk.bandcamp.com/",
                "website": null
            },
            "picture": "https://f4.bcbits.com/img/0003337739_10.jpg",
            "bio": null
        },
        {
            "bandName": "Sundowner",
            "hometown": "Portland, OR",
            "socials": {
                "facebook": "https://www.facebook.com/sundownermusic",
                "twitter": null,
                "instagram": "https://instagram.com/sundowner",
                "bandcamp": "https://sundownerrock.bandcamp.com/",
                "website": null
            },
            "picture": "https://f4.bcbits.com/img/0003960138_10.jpg",
            "bio": null
        },
        {
            "bandName": "Teenage Bottlerocket",
            "hometown": "Laramie, WY",
            "socials": {
                "facebook": "https://www.facebook.com/teenagebottlerocketofficial",
                "twitter": "https://twitter.com/teenbottlerock",
                "instagram": "https://instagram.com/teenagebottlerocket",
                "bandcamp": "https://teenagebottlerocket.bandcamp.com/",
                "website": "https://teenagebottlerocket.com/"
            },
            "picture": "https://f4.bcbits.com/img/0015327439_10.jpg",
            "bio": null
        },
        {
            "bandName": "Tightwire",
            "hometown": "Minneapolis, MN",
            "socials": {
                "facebook": "https://www.facebook.com/tightwireMPLS/",
                "twitter": "https://twitter.com/tanegraves",
                "instagram": "https://instagram.com/tightewirempls",
                "bandcamp": "https://tightwirempls.bandcamp.com/",
                "website": "https://tightwirempls.com/"
            },
            "picture": "https://f4.bcbits.com/img/0027509249_10.jpg",
            "bio": null
        },
        {
            "bandName": "Tired Radio",
            "hometown": "Brooklyn, NY",
            "socials": {
                "facebook": "https://www.facebook.com/tiredradiomusic/",
                "twitter": null,
                "instagram": "https://www.instagram.com/tired_radio/",
                "bandcamp": "https://tiredradio.bandcamp.com/",
                "website": null
            },
            "picture": "https://spacejockey.blob.core.windows.net/redscarecdn/bandpics/TR_BioPic.jpg",
            "bio": "Tired Radio was born in Brooklyn, and was originally a solo project for singer/songwriter, Anthony Truzzolino.  If you think he can pour a perfect Caffè ristretto based purely on his name… well, that’s racist of you, and you should be ashamed of yourself—but you’d be right.  A crew of New Yorkers formed around Tony’s emotive punk songs and they quickly became the go-to opener for bands coming through NYC.  Everyone on the East Coast was telling us that Red Scare needed to join forces with Tired Radio because they’re great people and their songs rule.  At some point after a Brendan Kelly show, the band met up with the label at a dicey American Legion bar in Red Hook around 3am.  (Kinda sounds like a Springsteen tale, eh?)  That’s the best part of those VFW bars, A: they’re lawless and stay open all night, and B: you can hang out and talk music with rad bands like Tired Radio. \n\nWe’re not the only people excited about this young quartet, ‘cuz Chris from LTJ talked them up on his podcast, and Cone from Sum 41 played them on his radio show.  They’re new to us, but they’ve already built a following from Montreal to Hamburg.  There’s gas in the tank and a new record on the way: <i>Hope In The Haze</i>.  If you’re into punk rock from Long Island and the Midwest and Jersey, then this could be your new favorite band.\n\n- tj"
        },
        {
            "bandName": "Vultures United",
            "hometown": "Fountain Valley, CA",
            "socials": {
                "facebook": "https://www.facebook.com/vulturesunited",
                "twitter": null,
                "instagram": "https://instagram.com/vulturesunited",
                "bandcamp": "https://vulturesunited.bandcamp.com/",
                "website": null
            },
            "picture": "https://spacejockey.blob.core.windows.net/redscarecdn/bandpics/vulturesunited.jpg",
            "bio": "Devin from Cobra Skulls hepped us to Vultures United after seeing them play a show in Los Angeles.  “You gotta check out this hardcore band that has TWO singers.  They’re terrifying!”  We’re paraphrasing, but you get the idea.    By the time we got ahold of the band, they were down to just one frontman, Jordan Salazar.  Jordan likes all the cool bands and all the bad soccer teams, but is a really swell guy despite his band’s menacing output.  They delivered a cool record and did a couple tours with Gallows, but things slowed down and they’re currently inactive.  Fast forward to L.A. right now, where you can’t throw a $9 artisanal donut and miss a hipster hardcore band.  That music is wildly successful these days, and Vultures United were doing it years ago. \n\n- tj"
        },
        {
            "bandName": "Won't Stay Dead",
            "hometown": "Chicago, IL",
            "socials": {
                "facebook": "https://www.facebook.com/wontstaydeadchicago/",
                "twitter": null,
                "instagram": "https://www.instagram.com/wontstaydead/",
                "bandcamp": "https://wontstaydead.bandcamp.com/",
                "website": null
            },
            "picture": "https://spacejockey.blob.core.windows.net/redscarecdn/bandpics/WSD_biopic.jpg",
            "bio": "The Red Scare peeps first came across Won’t Stay Dead because they were handing out flyers at a punk show in Logan Square, Chicago.  That’s the kinda “true believer” DIY spirit we love to see!  Then we started attending their shows (I mean, they’re passing out handbills, duh!) and the band ripped.  They go all out for the live show: blood, goth-punk gear, the make-up, and a spooky merch table.  It’s the all the fun, playful shit that we used to love about punk rock.  Obviously, if you’re a fan of Alkaline Trio and The Misfits, you’re going to dig WSD like a grave, but the gals (Saffron and Violet) offer dual vocals and dueling harmonies that make for an even sweeter, scarier beast.  They appeared on the RS20 compilation and have played a few Red Scare shows, so we figured we should finally consecrate this unholy union with a new album, <i>Vindication</i>, their Red Scare debut.  And we say this with all the seriousness of a funeral home director: if we didn’t sign the band, they woulda put a hex on us and sent their bats to peck away at our carcasses.\n\n- tj"
        }
]